n = int(input("Укажите количество символов: "))
m = input("Укажите тип символа: ")
r = int(input("Укажите ориентацию линии (0 - горизонтальная, 1 - вертикальная: "))
# print("*" * n)
if r == 0:
    while n > 0:
        print(m, end=" ")
        n -= 1
elif r == 1:
    while n > 0:
        print(m)
        n -= 1
print("\nПрограмма завершена")